/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "出错创建新相册时，请检查您的互联网连接，稍后再试。";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "上传图片至Picasa网络相册时发生错误，请检查您的互联网连接，稍后再试。";

/* Could not create a new album */
"Could not create a new album" = "无法创建新相册";

/* Could not upload an image */
"Could not upload an image" = "无法上传图片";

